use leptos::prelude::*;

#[lazy]
async fn get_zcodes() -> Vec<(String, String)> {
    let country = [
        "中国-86",
        "香港特别行政区-852",
        "中国澳门特别行政区-853",
        "中国台湾地区-886",
        "阿尔巴尼亚-355",
        "阿尔及利亚-213",
        "阿富汗-93",
        "阿根廷-54",
        "阿拉斯加-1907",
        "阿联酋-971",
        "阿鲁巴岛-297",
        "阿曼-968",
        "阿塞拜疆-994",
        "阿森松-247",
        "埃及-20",
        "埃塞俄比亚-251",
        "爱尔兰-353",
        "爱沙尼亚-372",
        "安道尔共和国-376",
        "安哥拉-244",
        "安圭拉岛-1809",
        "奥地利-43",
        "澳大利亚-61",
        "巴巴多斯-1809",
        "巴哈马-1809",
        "巴基斯坦-92",
        "巴拉圭-595",
        "巴勒斯坦-970",
        "巴林-973",
        "巴拿马-507",
        "巴西-55",
        "保加利亚-359",
        "贝宁-229",
        "比利时-32",
        "冰岛-354",
        "波多黎各-1809",
        "波黑-387",
        "波兰-48",
        "玻利维亚-591",
        "伯利兹-501",
        "博茨瓦纳-267",
        "不丹-975",
        "布基拉法索-226",
        "布隆迪-257",
        "朝鲜-850",
        "赤道几内亚-240",
        "丹麦-45",
        "德国-49",
        "东帝汶-670",
        "东萨摩亚-684",
        "多哥-228",
        "俄罗斯-7",
        "厄瓜多尔-593",
        "厄立特里亚-291",
        "法国-33",
        "法罗群岛-298",
        "法属圭亚那-594",
        "梵蒂冈-396",
        "菲律宾-63",
        "斐济-679",
        "芬兰-358",
        "佛得角-238",
        "福克兰群岛-500",
        "冈比亚-220",
        "刚果-242",
        "格林纳达-1473",
        "格鲁吉亚-995",
        "哥伦比亚-57",
        "哥斯达黎加-506",
        "格陵兰岛-299",
        "古巴-53",
        "瓜德罗普-590",
        "关岛-671",
        "圭亚那-592",
        "哈萨克斯坦-7",
        "海地-509",
        "韩国-82",
        "荷兰-31",
        "洪都拉斯-504",
        "基里巴斯-686",
        "吉布提-253",
        "吉尔吉斯斯坦-996",
        "几内亚-224",
        "几内亚比绍-245",
        "加拿大-1",
        "加纳-233",
        "加蓬-241",
        "柬埔寨-855",
        "捷克-420",
        "津巴布韦-263",
        "喀麦隆-237",
        "卡塔尔-974",
        "科科斯岛-6722",
        "科克群岛-682",
        "科摩罗-269",
        "科特迪瓦-225",
        "科威特-965",
        "克罗地亚-385",
        "肯尼亚-254",
        "拉脱维亚-371",
        "莱索托-266",
        "老挝-856",
        "黎巴嫩-961",
        "立陶宛-370",
        "利比里亚-231",
        "利比亚-218",
        "列支敦士登-423",
        "留尼旺岛-262",
        "卢森堡-352",
        "卢旺达-250",
        "罗马尼亚-40",
        "马达加斯加-261",
        "马尔代夫-960",
        "马耳他-356",
        "马拉维-265",
        "马来西亚-60",
        "马里-223",
        "马其顿-389",
        "马提尼克-596",
        "毛里求斯-230",
        "毛里塔尼亚-222",
        "美国-1",
        "蒙古-976",
        "孟加拉国-880",
        "秘鲁-51",
        "缅甸-95",
        "摩尔多瓦-373",
        "摩洛哥-212",
        "摩纳哥-377",
        "莫桑比克-258",
        "墨西哥-52",
        "纳米比亚-264",
        "南非-27",
        "南极洲-6721",
        "南斯拉夫-338",
        "南斯拉夫-381",
        "瑙鲁-674",
        "尼泊尔-977",
        "尼加拉瓜-505",
        "尼日尔-227",
        "尼日利亚-234",
        "纽埃岛-683",
        "挪威-47",
        "诺福克岛-6723",
        "葡萄牙-351",
        "普林西比-239",
        "日本-81",
        "瑞典-46",
        "瑞士-41",
        "萨尔瓦多-503",
        "塞拉利昂-232",
        "塞内加尔-221",
        "塞浦路斯-357",
        "塞舌尔-248",
        "沙特阿拉伯-966",
        "圣彼埃尔-508",
        "圣诞岛-6189164",
        "圣多美-239",
        "圣赫勒拿-290",
        "圣卢西亚-1809",
        "圣马力诺-223",
        "斯里兰卡-94",
        "斯洛伐克-421",
        "斯洛文尼亚-386",
        "斯威士兰-268",
        "苏丹-249",
        "苏里南-597",
        "所罗门群岛-677",
        "索马里-252",
        "塔吉克斯坦-7",
        "泰国-66",
        "坦桑尼亚-255",
        "汤加-676",
        "突尼斯-216",
        "图瓦卢-688",
        "土耳其-90",
        "土库曼斯坦-993",
        "瓦努阿图-678",
        "危地马拉-502",
        "威克岛-1808",
        "维尔京群岛-1809",
        "委内瑞拉-58",
        "文莱-673",
        "乌干达-256",
        "乌克兰-380",
        "乌拉圭-598",
        "乌兹别克斯坦-998",
        "西班牙-34",
        "西萨摩亚-685",
        "希腊-30",
        "夏威夷-1808",
        "新加坡-65",
        "新西兰-64",
        "匈牙利-36",
        "匈牙利-336",
        "叙利亚-963",
        "牙买加-1876",
        "亚美尼亚-374",
        "也门-967",
        "伊拉克-964",
        "伊朗-98",
        "以色列-972",
        "意大利-39",
        "印度-91",
        "印度尼西亚-62",
        "英国-44",
        "约旦-962",
        "越南-84",
        "赞比亚-260",
        "扎伊尔-243",
        "乍得-235",
        "直布罗陀-350",
        "智利-56",
        "中非-236",
        "中途岛-1808",
    ];
    country
        .into_iter()
        .filter_map(|cn| {
            let mut chunks = cn.split('-').take(2);
            if let Some(cn) = chunks.next()
                && let Some(code) = chunks.next()
            {
                Some((format!("+{}", code), cn.to_owned()))
            } else {
                None
            }
        })
        .collect()
}

#[component]
pub fn Zcode(set_active: WriteSignal<(String, String)>) -> impl IntoView {
    stylance::import_crate_style!(css, "src/components/zcode.module.scss");

    let opened = RwSignal::new(false);

    let close_pop = move || {
        opened.update(|data| *data = false);
    };

    let result = LocalResource::new(move || get_zcodes());
    let (code, set_code) = signal("+86".to_owned());

    view! {
        <div
            class=css::zcode
            on:click=|e| {
                e.stop_propagation();
            }
        >
            <label class=css::head>
                <input type="checkbox" bind:checked=opened />
                <span>{move || code.get()}</span>
            </label>
            <ul class=css::pop>
                <Suspense fallback=|| {
                    "..."
                }>
                    {move || Suspend::new(async move {
                        let data = result.get().unwrap_or(vec![]);
                        data.into_iter()
                            .map(|(code, name)| {
                                view! {
                                    <li
                                        class=css::item
                                        on:click=move |_| {
                                            leptos::logging::log!("{} - {}", code, name);
                                            set_code.set(code.clone());
                                            set_active
                                                .update(|data| *data = (code.clone(), name.clone()));
                                            close_pop();
                                        }
                                    >
                                        <span>{code.clone()}</span>
                                        <span>{name.clone()}</span>
                                    </li>
                                }
                            })
                            .collect_view()
                    })}
                </Suspense>
            </ul>
        </div>
    }
}
